Pandas Data Structure

In [2]:
#series
import pandas as pd
import numpy as np

arr = np.array([1,2,3,4])
s = pd.Series(arr) #series

s

0    1
1    2
2    3
3    4
dtype: int32

In [3]:
#Data Frame
import pandas as pd

# Sample data
data = {
    "Student_ID": [1, 2, 3, 4, 5],
    "Name": ["Alice", "Bob", "Charlie", "David", "Eva"],
    "Score": [12, 18, 15, 20, 17],
    "Age": [16, 17, 16, 18, 17]
}

# Create DataFrame
df = pd.DataFrame(data)

# Display DataFrame
print(df)

   Student_ID     Name  Score  Age
0           1    Alice     12   16
1           2      Bob     18   17
2           3  Charlie     15   16
3           4    David     20   18
4           5      Eva     17   17

CSV File

In [6]:
#write to csv file..
df.to_csv("df_csv.csv")


#Read from CSV file..
ddf = pd.read_csv("df_csv.csv")
ddf

   Unnamed: 0  Student_ID     Name  Score  Age
0           0           1    Alice     12   16
1           1           2      Bob     18   17
2           2           3  Charlie     15   16
3           3           4    David     20   18
4           4           5      Eva     17   17

Excel File

In [8]:
#write to excel file..

df.to_excel("df_xl.xlsx") #To Convert into excel file
dex = pd.read_excel("df_xl.xlsx")
dex

   Unnamed: 0  Student_ID     Name  Score  Age
0           0           1    Alice     12   16
1           1           2      Bob     18   17
2           2           3  Charlie     15   16
3           3           4    David     20   18
4           4           5      Eva     17   17

JSON File.

In [10]:
#Write a json file

df.to_json("df_json.json")

dj = pd.read_json("df_json.json")
dj

   Student_ID     Name  Score  Age
0           1    Alice     12   16
1           2      Bob     18   17
2           3  Charlie     15   16
3           4    David     20   18
4           5      Eva     17   17

Inspecting Data

In [11]:
df

   Student_ID     Name  Score  Age
0           1    Alice     12   16
1           2      Bob     18   17
2           3  Charlie     15   16
3           4    David     20   18
4           5      Eva     17   17

In [12]:
#head
df.head(2) #first 2 rows

   Student_ID   Name  Score  Age
0           1  Alice     12   16
1           2    Bob     18   17

In [13]:
#tails
df.tail(2) #last 2 rows

   Student_ID   Name  Score  Age
3           4  David     20   18
4           5    Eva     17   17

In [17]:
#shape  

df.shape  #rows and columns

(5, 4)

In [18]:
#info
df.info() #data types , non-null values

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Student_ID  5 non-null      int64
 1   Name        5 non-null      object
 2   Score       5 non-null      int64
 3   Age         5 non-null      int64
dtypes: int64(3), object(1)
memory usage: 292.0+ bytes

In [19]:
#Describe 

df.describe() #it give sumarry of statstic

       Student_ID     Score       Age
count    5.000000   5.00000   5.00000
mean     3.000000  16.40000  16.80000
std      1.581139   3.04959   0.83666
min      1.000000  12.00000  16.00000
25%      2.000000  15.00000  16.00000
50%      3.000000  17.00000  17.00000
75%      4.000000  18.00000  17.00000
max      5.000000  20.00000  18.00000

In [20]:
#Index
df.index

RangeIndex(start=0, stop=5, step=1)

Selecting Data

In [21]:
df

   Student_ID     Name  Score  Age
0           1    Alice     12   16
1           2      Bob     18   17
2           3  Charlie     15   16
3           4    David     20   18
4           5      Eva     17   17

In [22]:
df["Name"] #Single columns

0      Alice
1        Bob
2    Charlie
3      David
4        Eva
Name: Name, dtype: object

In [23]:
df[["Name","Score"]] #multiple columns

      Name  Score
0    Alice     12
1      Bob     18
2  Charlie     15
3    David     20
4      Eva     17

Select Row

In [ ]:
#loc
df.loc[2]  #label Based

Student_ID          3
Name          Charlie
Score              15
Age                16
Name: 2, dtype: object

In [25]:
df

   Student_ID     Name  Score  Age
0           1    Alice     12   16
1           2      Bob     18   17
2           3  Charlie     15   16
3           4    David     20   18
4           5      Eva     17   17

In [29]:
#iloc
df.iloc[0:2] #index-label

   Student_ID   Name  Score  Age
0           1  Alice     12   16
1           2    Bob     18   17

Select Subset

In [30]:
df.loc[0:2,["Name","Score"]]

      Name  Score
0    Alice     12
1      Bob     18
2  Charlie     15

In [31]:
df.iloc[0:3,0:2]

   Student_ID     Name
0           1    Alice
1           2      Bob
2           3  Charlie

Filtering Data

In [33]:
df

   Student_ID     Name  Score  Age
0           1    Alice     12   16
1           2      Bob     18   17
2           3  Charlie     15   16
3           4    David     20   18
4           5      Eva     17   17

In [ ]:
df[df["Score"] >15] #Score greater than 15

   Student_ID   Name  Score  Age
1           2    Bob     18   17
3           4  David     20   18
4           5    Eva     17   17

In [37]:
df[df["Score"] <15] #score less tahn 15

   Student_ID   Name  Score  Age
0           1  Alice     12   16

In [39]:
df[(df["Score"]>15) & (df["Age"] >15)]

   Student_ID   Name  Score  Age
1           2    Bob     18   17
3           4  David     20   18
4           5    Eva     17   17